#111
입력저장=input("입력: ")
print(입력저장*2)#문자*2:반복출력
#112
입력저장=int(input("숫자입력 :"))
print(입력저장*10)
#113
입력저장=int(input("홀수/짝수판단 정수입력 :"))
if 입력저장%2==0:
    print("짝수")
else:
    print("홀수")
#114
입력저장=int(input("숫자입력 :"))
더한값=입력저장+20
if 더한값>255:
    print(255)
else:
    print(더한값)
#115
입력저장=int(input("숫자입력 :"))
뺀값=입력저장-20
if 뺀값<0:
    print(0)
elif 뺀값>255:
    print(255)
else:
    print(뺀값)

#116
입력저장=input("시간입력(예:02:10,06:12,12:23) :")
if 입력저장[-2:]=="00":
    print("정각입니다")
else:
    print("정각이아닙니다")
#117
과일=["사과","포도","홍시"]
입력과일=input("좋아하는 과일은?:")
if 입력과일 in 과일:
    print("정답입니다")
else:
    print("오답입니다")

#118
투자경고리스트=["마이크로소프트","구글","네이버","카카오","삼성","엘지"]
종목=input("종목선택:")
if 종목 in 투자경고리스트:
    print("투자경고종목 입니다")
else:
    print("투자 경고 종목이 아닙니다")
#119
과일={"봄":"딸기","여름":"토마토","가을":"사과"}
입력계절=input("좋아하는 계절은?:")
if 입력계절 in 과일:
    print("정답입니다")
else:
    print("오답입니다")
#120
과일={"봄":"딸기","여름":"토마토","가을":"사과"}
입력과일=input("좋아하는 과일은:")
if 입력과일 in 과일:
    print("정답입니다")
else:
    print("오답입니다")


