#딕셔너리
    #하나의 키와 값으로 이루어진
    #딕셔너리명={키:값,키2:값2,키3:값3}
#문제81
scores=[8.8,8.9,8.7,9.2,9.3,9.7,9.9,9.5,7.8,9.4]
print(*scores)
*scores,_,_=scores
print(scores)
#문제82
scores=[8.8,8.9,8.7,9.2,9.3,9.7,9.9,9.5,7.8,9.4]
_,_,*scores=scores
print(scores)
#문제83
scores=[8.8,8.9,8.7,9.2,9.3,9.7,9.9,9.5,7.8,9.4]
_,*scores,_=scores
print(scores)
#문제84
temp={}

#문제85
아이스크림={"메로나":1000,"폴라포":1200,"빵빠레":1800}
#문제86
아이스크림={"메로나":1000,"폴라포":1200,"빵빠레":1800}
아이스크림["죠스바"]=1200
아이스크림["월드콘"]=1500
#문제87
아이스크림={"메로나":1000,
       "폴라포":1200,
       "빵빠레":1800,
       "죠스바":1200,
       "월드콘":1500}
print("메로나 가격: ",아이스크림["메로나"])
#문제88
아이스크림={"메로나":1000,
       "폴라포":1200,
       "빵빠레":1800,
       "죠스바":1200,
       "월드콘":1500}
아이스크림["메로나"]=1000
print("메로나 가격:",아이스크림["메로나"])

#문제89
아이스크림={"메로나":1000,
       "폴라포":1200,
       "빵빠레":1800,
       "죠스바":1200,
       "월드콘":1500}
del 아이스크림["메로나"]
print(아이스크림)
#문제90
#아이스크림={"폴라포":1200,"빵빠레":1800,"죠스바":1200,"월드콘":1500}
#아이스크림["누가바"]
#아이스크림['누가바']